In [1]:
import pandas as pd
import numpy as np

## Tạo Series

In [2]:
#Tạo một Series từ danh sách 5 tên sinh viên và điểm số (80, 85, 90, 75, 88)
series = pd.Series([80, 90, 85, 100, 50], index=["Nam","Tâm","Huy","Hoàng","Anh"])
series

Nam       80
Tâm       90
Huy       85
Hoàng    100
Anh       50
dtype: int64

In [3]:
#In ra Series và truy cập điểm của sinh viên thứ 3
series[2]

C:\Users\Nhat Nam\AppData\Local\Temp\ipykernel_15032\2522577365.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  series[2]

np.int64(85)

## Tạo DataFrame

In [4]:
#Tạo một DataFrame từ từ điển chứa thông tin: tên, tuổi, điểm toán của 5 học sinh
data = {
    "Name": ["Nam","Tom","Lucas","Lucy","Su"],
    "Age": [21, 30, 19, 17, 31],
    "Math_Score": [8, 10, 10, 9, 2]
}
df = pd.DataFrame(data)
df

    Name  Age  Math_Score
0    Nam   21           8
1    Tom   30          10
2  Lucas   19          10
3   Lucy   17           9
4     Su   31           2

In [5]:
df["Name"]

0      Nam
1      Tom
2    Lucas
3     Lucy
4       Su
Name: Name, dtype: object

## Thêm cột mới

In [6]:
#Từ DataFrame ở bài 2, thêm cột 'điểm văn' với giá trị ngẫu nhiên từ 1 đến 10
df["Literature_score"] = np.random.randint(1,11,size=5)

## Làm sạch dữ liệu

In [18]:
#Tạo một DataFrame với 5 hàng, thêm 2 giá trị NaN ngẫu nhiên vào cột tuổi
df_1 = pd.DataFrame({
    "name": ["A", "B", "C", "D", "E"],
    "age": [20, 25, 30, 35, 40]
})
nan_indices = np.random.choice(df_1.index,size=2,replace=False)
df_1.loc[nan_indices,"age"] = np.nan

In [19]:
#Thay NaN bằng giá trị trung bình của cột tuổi
value_mean = np.nanmean(df_1['age'],axis=0)
df_1.loc[nan_indices,"age"] = value_mean

## Truy cập dữ liệu

In [ ]:
#Từ df, truy cập hàng thứ 2 bằng loc và iloc
df.iloc[1]

Name                Tom
Age                  30
Math_Score           10
Literature_score      9
Name: 1, dtype: object

In [24]:
df

    Name  Age  Math_Score  Literature_score
0    Nam   21           8                 3
1    Tom   30          10                 9
2  Lucas   19          10                 3
3   Lucy   17           9                 3
4     Su   31           2                 6

In [26]:
df.loc[1]

Name                Tom
Age                  30
Math_Score           10
Literature_score      9
Name: 1, dtype: object